# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. Напишете
# програма, която изчислява какви разходи ще има Джеси, ако започне да тренира, като знаете колко е
# таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка:
# • Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# • Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# • Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# • Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

yearly_rate = int(input())

sneakers = yearly_rate * 60 / 100
outfit = sneakers * 80 / 100
ball = outfit * 1 / 4
accessories = ball * 1 / 5

cost = sneakers + outfit + ball + accessories + yearly_rate

print(cost)

